In [1]:
import numpy as np
import pandas as pd

In [2]:
dict1 = {
    "name": ['imran', 'ali', 'ahmad', 'akram'],
    "marks": [92, 54, 56, 75],
    "city": ['swabi', 'peshawar', 'islamabad', 'sialkot']
}

In [3]:
df = pd.DataFrame(dict1)

In [6]:
df

    name  marks       city
0  imran     92      swabi
1    ali     54   peshawar
2  ahmad     56  islamabad
3  akram     75    sialkot

## Read or write to external files

In [29]:
# To put in excel sheet
df.to_csv('list1.csv')

In [30]:
df.to_json('list2.json')

In [31]:
pd.read_csv('list1.csv')

   Unnamed: 0   name  marks       city
0           0  imran     92      swabi
1           1    ali     54   peshawar
2           2  ahmad     56  islamabad
3           3  akram     75    sialkot

In [32]:
pd.read_json('list2.json')

    name  marks       city
0  imran     92      swabi
1    ali     54   peshawar
2  ahmad     56  islamabad
3  akram     75    sialkot

In [33]:
# which without index
df.to_csv('friend.csv', index=False)

In [7]:
# if dataframe is very big,to see some first rows or last rows
df.head(2)

    name  marks      city
0  imran     92     swabi
1    ali     54  peshawar

In [18]:
df.tail(2)

    name  marks       city
2  ahmad     56  islamabad
3  akram     75    sialkot

In [8]:
df.describe()

           marks
count   4.000000
mean   69.250000
std    17.876894
min    54.000000
25%    55.500000
50%    65.500000
75%    79.250000
max    92.000000

In [20]:
# Read cvs
friends = pd.read_csv('friend.csv')

In [21]:
friends

    name  marks       city
0  imran     92      swabi
1    ali     54   peshawar
2  ahmad     56  islamabad
3  akram     75    sialkot

## Series

In [9]:
ser = pd.Series(np.random.rand(10))

In [12]:
ser

0    0.015311
1    0.761080
2    0.405675
3    0.556406
4    0.302659
5    0.626105
6    0.841760
7    0.811926
8    0.735968
9    0.795264
dtype: float64

In [13]:
type(ser)

pandas.core.series.Series

## Dataframes

In [14]:
newdf = pd.DataFrame(np.random.rand(334,5), index=np.arange(334))

In [15]:
newdf

            0         1         2         3         4
0    0.194631  0.173185  0.253506  0.445706  0.838651
1    0.897244  0.913982  0.071507  0.553565  0.215975
2    0.492833  0.503727  0.379485  0.603895  0.372360
3    0.864099  0.576215  0.408168  0.962408  0.794521
4    0.595129  0.698329  0.842381  0.917981  0.096613
..        ...       ...       ...       ...       ...
329  0.604529  0.827517  0.240447  0.312540  0.611120
330  0.850126  0.503696  0.663271  0.220942  0.681116
331  0.537953  0.969158  0.437275  0.556176  0.706750
332  0.683508  0.382061  0.263535  0.487740  0.248577
333  0.589409  0.981801  0.606469  0.303081  0.126072

[334 rows x 5 columns]

In [16]:
type(newdf)

pandas.core.frame.DataFrame

In [17]:
newdf.describe()

                0           1           2           3           4
count  334.000000  334.000000  334.000000  334.000000  334.000000
mean     0.484341    0.492770    0.468830    0.522171    0.491538
std      0.280913    0.289369    0.278079    0.278883    0.296110
min      0.000300    0.001263    0.002256    0.005480    0.002480
25%      0.235265    0.237169    0.232353    0.301791    0.210169
50%      0.471335    0.500532    0.444085    0.514211    0.505731
75%      0.701222    0.752281    0.686633    0.764621    0.743844
max      0.999936    0.996240    0.998460    0.999103    0.997162

In [18]:
newdf.dtypes

0    float64
1    float64
2    float64
3    float64
4    float64
dtype: object

In [19]:
# change data in a cell
newdf[0][0] = "imran"

C:\Users\PC\AppData\Local\Temp\ipykernel_5300\2601335246.py:2: FutureWarning: Setting an item of incompatible dtype is deprecated and will raise in a future error of pandas. Value 'imran' has dtype incompatible with float64, please explicitly cast to a compatible dtype first.
  newdf[0][0] = "imran"

In [20]:
newdf.head(2)

          0         1         2         3         4
0     imran  0.173185  0.253506  0.445706  0.838651
1  0.897244  0.913982  0.071507  0.553565  0.215975

In [21]:
newdf.dtypes

0     object
1    float64
2    float64
3    float64
4    float64
dtype: object

In [22]:
newdf.to_numpy()

array([['imran', 0.17318474693321717, 0.25350633065478545,
        0.44570593950099213, 0.8386512596224928],
       [0.897244056072484, 0.9139816674748478, 0.07150738172746052,
        0.5535648487750221, 0.21597530665106357],
       [0.4928327672666837, 0.5037270724587292, 0.3794850847828184,
        0.603895408738938, 0.37235951938692113],
       ...,
       [0.5379529366611049, 0.969157535894877, 0.4372745748943617,
        0.5561755048382016, 0.7067500777913213],
       [0.6835077106169061, 0.38206078684712175, 0.26353463319210846,
        0.4877395872724597, 0.2485768903868517],
       [0.5894092092669384, 0.9818005540935916, 0.6064687590178851,
        0.3030812382839998, 0.12607151681777473]], dtype=object)

In [44]:
# transpose
newdf.T

,0,1,2,3,4,5,6,7,8,9,...,324,325,326,327,328,329,330,331,332,333
0,imran,0.033486,0.381868,0.010762,0.060316,0.084896,0.890253,0.767231,0.583252,0.63853,...,0.955537,0.58347,0.938892,0.760929,0.567304,0.136621,0.674854,0.543409,0.261113,0.19152
1,0.96823,0.414209,0.05247,0.346614,0.117865,0.545345,0.612895,0.673548,0.920465,0.180145,...,0.818945,0.719187,0.727494,0.436278,0.107453,0.635423,0.498759,0.236225,0.670622,0.100586
2,0.428492,0.961543,0.868436,0.173182,0.506711,0.316032,0.221999,0.392511,0.465598,0.160522,...,0.484969,0.29026,0.022922,0.607466,0.304058,0.126561,0.59004,0.8379,0.848614,0.912902
3,0.254799,0.378168,0.415003,0.193108,0.944531,0.343798,0.224355,0.65036,0.286169,0.094803,...,0.648178,0.512679,0.400351,0.17802,0.785179,0.975457,0.452137,0.75287,0.161915,0.47765
4,0.742577,0.199287,0.646704,0.493332,0.573925,0.892132,0.539644,0.556995,0.192647,0.526025,...,0.915768,0.528738,0.783859,0.642321,0.828174,0.051883,0.187723,0.192815,0.902897,0.806222

In [45]:
# sorting
newdf.sort_index(axis=0, ascending=False)

            0         1         2         3         4
333   0.19152  0.100586  0.912902  0.477650  0.806222
332  0.261113  0.670622  0.848614  0.161915  0.902897
331  0.543409  0.236225  0.837900  0.752870  0.192815
330  0.674854  0.498759  0.590040  0.452137  0.187723
329  0.136621  0.635423  0.126561  0.975457  0.051883
..        ...       ...       ...       ...       ...
4    0.060316  0.117865  0.506711  0.944531  0.573925
3    0.010762  0.346614  0.173182  0.193108  0.493332
2    0.381868  0.052470  0.868436  0.415003  0.646704
1    0.033486  0.414209  0.961543  0.378168  0.199287
0       imran  0.968230  0.428492  0.254799  0.742577

[334 rows x 5 columns]

In [46]:
# view
newdf2 = newdf

In [47]:
newdf2[0][0] = 9783

In [48]:
newdf

            0         1         2         3         4
0        9783  0.968230  0.428492  0.254799  0.742577
1    0.033486  0.414209  0.961543  0.378168  0.199287
2    0.381868  0.052470  0.868436  0.415003  0.646704
3    0.010762  0.346614  0.173182  0.193108  0.493332
4    0.060316  0.117865  0.506711  0.944531  0.573925
..        ...       ...       ...       ...       ...
329  0.136621  0.635423  0.126561  0.975457  0.051883
330  0.674854  0.498759  0.590040  0.452137  0.187723
331  0.543409  0.236225  0.837900  0.752870  0.192815
332  0.261113  0.670622  0.848614  0.161915  0.902897
333   0.19152  0.100586  0.912902  0.477650  0.806222

[334 rows x 5 columns]

In [49]:
# copy()
newdf2 = newdf.copy()

In [50]:
newdf2[0][0] = 89898

C:\Users\PC\AppData\Local\Temp\ipykernel_8860\1658867033.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  newdf2[0][0] = 89898

In [51]:
newdf2

            0         1         2         3         4
0       89898  0.968230  0.428492  0.254799  0.742577
1    0.033486  0.414209  0.961543  0.378168  0.199287
2    0.381868  0.052470  0.868436  0.415003  0.646704
3    0.010762  0.346614  0.173182  0.193108  0.493332
4    0.060316  0.117865  0.506711  0.944531  0.573925
..        ...       ...       ...       ...       ...
329  0.136621  0.635423  0.126561  0.975457  0.051883
330  0.674854  0.498759  0.590040  0.452137  0.187723
331  0.543409  0.236225  0.837900  0.752870  0.192815
332  0.261113  0.670622  0.848614  0.161915  0.902897
333   0.19152  0.100586  0.912902  0.477650  0.806222

[334 rows x 5 columns]

##

In [52]:
# for setting value we normally use loc
newdf.loc[0,0] = 645

In [53]:
newdf.head(2)

          0         1         2         3         4
0       645  0.968230  0.428492  0.254799  0.742577
1  0.033486  0.414209  0.961543  0.378168  0.199287

In [54]:
newdf.columns = list("ABCDE")

In [55]:
newdf.head(2)

          A         B         C         D         E
0       645  0.968230  0.428492  0.254799  0.742577
1  0.033486  0.414209  0.961543  0.378168  0.199287

In [56]:
newdf = newdf.drop('E', axis=1)

In [57]:
newdf.head(2)

          A         B         C         D
0       645  0.968230  0.428492  0.254799
1  0.033486  0.414209  0.961543  0.378168

In [58]:
newdf.loc[(newdf['A']<0.3)]

            A         B         C         D
1    0.033486  0.414209  0.961543  0.378168
3    0.010762  0.346614  0.173182  0.193108
4    0.060316  0.117865  0.506711  0.944531
5    0.084896  0.545345  0.316032  0.343798
16   0.289129  0.756770  0.112589  0.233407
..        ...       ...       ...       ...
316  0.014109  0.483889  0.510604  0.342308
318  0.139745  0.408488  0.672072  0.542197
329  0.136621  0.635423  0.126561  0.975457
332  0.261113  0.670622  0.848614  0.161915
333   0.19152  0.100586  0.912902  0.477650

[92 rows x 4 columns]

In [23]:
df = pd.DataFrame({"name": ['Alfred', 'Batman', 'Catwoman'],
                    "toy": [np.nan, 'Batmobile', 'Bullwhip'],
                    "born": [pd.NaT, pd.Timestamp("1940-04-25"),
                            pd.NaT]})

In [24]:
df.head()

       name        toy       born
0    Alfred        NaN        NaT
1    Batman  Batmobile 1940-04-25
2  Catwoman   Bullwhip        NaT

In [25]:
df.dropna()

     name        toy       born
1  Batman  Batmobile 1940-04-25

In [26]:
df.drop_duplicates(subset=["born"])

     name        toy       born
0  Alfred        NaN        NaT
1  Batman  Batmobile 1940-04-25

In [27]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3 entries, 0 to 2
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   name    3 non-null      object
 1   toy     2 non-null      object
 2   born    1 non-null      datetime64[ns]
dtypes: datetime64[ns](1), object(2)
memory usage: 204.0+ bytes

#### Create a dataframe which contain only integers with 3 rows and 2 columns

##### Run the following methods
- df.describe
- df.mean()
- df.corr()
- df.count()
- df.max()
- df.min()
- df.median()
- df.std()

In [30]:
mydf = pd.DataFrame( {
    "name": ['imran', 'ali', 'ahmad', 'akram'],
    "marks": [92, 54, 56, 75],
    "city": ['swabi', 'peshawar', 'islamabad', 'sialkot']
})

In [31]:
mydf

    name  marks       city
0  imran     92      swabi
1    ali     54   peshawar
2  ahmad     56  islamabad
3  akram     75    sialkot

In [32]:
mydf.describe()

           marks
count   4.000000
mean   69.250000
std    17.876894
min    54.000000
25%    55.500000
50%    65.500000
75%    79.250000
max    92.000000

In [34]:
# mydf.mean()

In [35]:
mydf.corr

<bound method DataFrame.corr of     name  marks       city
0  imran     92      swabi
1    ali     54   peshawar
2  ahmad     56  islamabad
3  akram     75    sialkot>

In [36]:
mydf.max()

name     imran
marks       92
city     swabi
dtype: object

In [37]:
mydf.min()

name         ahmad
marks           54
city     islamabad
dtype: object